{
  "recipes": [
    {
      "Title": "Sriracha Peanut Chicken Meal Prep",
      "TotalTime": "30 minutes",
      "ServingSize": "5 servings",
      "Img": "/img/siracha-chicken.jpg",
      "Type": "Shrink",
      "Calories": 584,
      "Protein": "45g",
      "Carbs": "54g",
      "Ingredients": {
        "SAUCE": [
          "¼ cup (60 g) soy sauce",
          "2 tbsp (28 g) peanut butter",
          "1 tbsp (15 g) rice vinegar",
          "2 tbsp (42 g) honey",
          "2 cloves (15 g) minced garlic",
          "1 tbsp (15 g) sriracha",
          "2 tsp (10 g) sesame oil"
        ],
        "CHICKEN": [
          "2 lbs (908 g) boneless skinless chicken thighs",
          "1 tbsp (14 g) mayonnaise",
          "1 tbsp (15 g) sriracha",
          "1 tbsp (15 g) rice vinegar",
          "2 tsp (6 g) onion powder",
          "2 tsp (6 g) garlic powder",
          "1 tsp (6 g) salt"
        ],
        "RICE BOWLS": [
          "3 medium (100 g) carrots",
          "½ lb (227 g) broccoli",
          "1 small (150 g) onion",
          "3 cups (450 g) cooked rice",
          "1 tbsp (15 g) oil",
          "2 (15 g) green onions optional",
          "¼ cup (30 g) crushed peanuts optional"
        ]
      },
      "Instructions": [
        {
          "Section": "For the rice",
          "Steps": [
            "Day-old rice is best for these rice bowl-style recipes as it has had time to dry out a bit. Frozen rice is also a good choice. If you don't want to wait for day-old rice, fresh rice works well too.",
            "Prepare enough rice to yield 3 cups of cooked rice. 1 cup of dry rice will make 2-3 cups of cooked rice depending on the kind of rice you are using."
          ]
        },
        {
          "Section": "For the chicken",
          "Steps": [
            "Preheat your oven to 425°F.",
            "In a bowl, add the mayo, sriracha, rice vinegar, garlic powder, onion powder, and salt. Mix together to combine.",
            "Add the chicken thighs to the bowl and toss to coat. Marinating this for an hour or two can help make the chicken more flavorful, but it's also fine to cook it right away.",
            "Line a sheet pan with foil or parchment and lay the chicken thighs on top with the smooth side facing down. Roast for 10 minutes, then turn the oven to broil and broil for about 5 minutes to brown the chicken. Be careful not to burn the chicken as the broiler is very hot.",
            "Allow the chicken to rest for a couple of minutes, then dice it into bite-sized pieces."
          ]
        },
        {
          "Section": "For the sauce",
          "Steps": [
            "Mix all of the sauce ingredients in a bowl and stir vigorously."
          ]
        },
        {
          "Section": "For the rice bowls",
          "Steps": [
            "Cut your onion into thin slices.",
            "Chop the broccoli into small, bite-sized florets.",
            "Shred the carrots into ribbons using a vegetable peeler.",
            "Chop the green onion tops into thin slices.",
            "In a large skillet over medium-high heat, add the broccoli with about ¼ cup of water. This will help it steam and cook to soften. By the time the water boils off, they will be close to being ready, and you can cook the remaining vegetables.",
            "Make room in the center of the skillet and add 1 tbsp of oil. Dump the onions into the center and cook for about 1-2 minutes so they get some color. Add in the carrots shortly after and cook the vegetables together for another minute or two.",
            "Add your cooked rice to the skillet and pour the sauce over the top of the rice and vegetables. Stir to combine and coat the contents of the pan.",
            "Add in the chicken and mix. Taste test and adjust the seasonings with salt and pepper as needed. If you want more spice, use more sriracha. Any of the flavors can be adjusted to meet your preferences."
          ]
        },
        {
          "Section": "Plating",
          "Steps": [
            "This recipe makes 5 servings. Divide the contents of the skillet evenly into your 5 containers.",
            "Top each dish with green onions and crushed peanuts."
          ]
        }
      ]
    },
    {
      "Title": "Baked Penne",
      "TotalTime": "1 hour 10 minutes",
      "ServingSize": "5 servings",
      "Img": "/img/baked-penne.jpg",
      "Type": "Big",
      "Calories": 1040,
      "Protein": "68g",
      "Carbs": "86g",
      "Ingredients": {
        "Penne Pasta Noodles": [
          "12 oz (340 g) penne pasta noodles uncooked, gluten free if needed"
        ],
        "Ground Beef and Tomato Sauce": [
          "2 lbs (908 g) ground beef 85/15",
          "28 oz (794 g) petite diced tomatoes (3 cans)",
          "28 oz (794 g) crushed tomatoes (1 can)",
          "1 medium (200 g) onion",
          "1 tbsp (15 g) minced garlic",
          "1 tbsp (2 g) dried oregano",
          "1 tbsp (2 g) dried basil",
          "10 oz (283 g) spinach (1 bag)",
          "1 tbsp (15 g) oil",
          "Salt and pepper to taste"
        ],
        "Cheese Topping": [
          "15 oz (425 g) low-fat ricotta cheese",
          "1 cup (112 g) shredded mozzarella cheese",
          "½ cup (50 g) shredded parmesan cheese"
        ]
      },
      "Instructions": [
        {
          "Section": "For the Beef and Tomato Sauce",
          "Steps": [
            "In a large pot over medium-high heat, add the ground beef and brown.",
            "While the beef is cooking, dice the onion and add it to the pot with the beef. Add the minced garlic as well. Season lightly with salt and pepper.",
            "Once the meat has browned, add in the cans of petite diced and crushed tomatoes. Stir in the oregano and basil. Allow the mixture to boil for 10-20 minutes to cook out the tomato flavor.",
            "Chop up the spinach and add it to the pot. Stir to incorporate and wilt the leaves."
          ]
        },
        {
          "Section": "For the Casserole",
          "Steps": [
            "Preheat your oven to 400°F.",
            "While the beef and sauce are cooking, bring a large pot of water to a boil and cook the noodles according to the packaging. Drain the water.",
            "Once the noodles and sauce have finished cooking, combine the two together and season with salt and pepper to taste.",
            "In a large casserole or baking dish, add about half of the noodle mixture in a single layer. Spread out the ricotta cheese over the top of this layer and pour the remaining noodle mixture over the top.",
            "Top the entire dish with the parmesan and mozzarella cheese.",
            "Place the dish on a sheet pan to protect from any leakage and place it into the oven. Bake for 30 minutes. Watch it closely as you don't want to burn the cheese. If it gets too brown you can cover it with a piece of aluminum foil.",
            "Allow the casserole to rest and cool before cutting into it."
          ]
        },
        {
          "Section": "Plating",
          "Steps": [
            "This recipe makes 5 servings. Divide the tray into 5 equal-sized pieces and add to each of your dishes. They will last in the fridge for 5 days."
          ]
        }
      ]
    },
    {
      "Title": "Beer-Battered Fish Tacos",
      "TotalTime": "45 minutes",
      "ServingSize": "4-5 people",
      "Type": "Chef",
      "Calories": "Who cares",
      "Protein": "Dunno",
      "Carbs": "Enough",
      "Ingredients": {
        "Beer Battered Fish": [
          "2 lbs (1kg) cod (or whatever fish you want)",
          "Enough oil for frying",
          "1.5 cups (225g) of AP flour",
          "1 tbsp (7g) paprika",
          "1 tbsp (10g) galic powder",
          "2 tsp (10g) white pepper",
          "2.5 tsp (15g) fine sea salt",
          "1 large egg",
          "12 oz of a mexican beer (or light beer, but that's for losers)"
        ],
        "Slaw": [
          "0.5 head of green cabbage sliced thinnly (mandoline)",
          "1 Large red onion sliced thinnly (mandoline)",
          "0.5 cup chopped cilantro",
          "juice of 2 lemons",
          "2 tbsp (30ml) olive oil",
          "Salt and Pepper to taste"
        ],
        "Taco Sized Tortilla": [
          "Just buy like 16 from the store (homemade takes way to much time, and i'd rather die"
        ],
        "Toppings": [
          "Cilantro Leaves",
          "Lime Wedges",
          "Pickled Jalapenos"
        ],
        "Sauce": [
          "0.5 cups (123g) sour cream",
          "0.5 cups (115g) mayo",
          "1 tbsp (15ml) hot sauce",
          "2 tsp (5g) smoked paprika",
          "1 tbsp (15ml) chili oil",
          "1.5 tbsp (20ml) chinese black vinegar",
          "2 cloves of grated garlic"
        ]
      },
      "Instructions": [
        {
          "Section": "For the Beef Fish",
          "Steps": [
            "Cut the fish into 12cm x 5cm pieces.",
            "Salt them on all sides.",
            "Fill a pot or cast iron pan with oil (2 inches atleast) then heat it to 365°F.",
            "In a small bowl, add 0.5 cups (60g) of the flour.",
            "In a large bowl, add 1 cup (120g) of flour, the paprika, garlic powder, white pepper, salt, and the egg then whisk it together.",
            "Slowly add the beer and whisk slowly (try not to knock out too much of the gas from the beer).",
            "Take the fish, and dredge it in the plain flour and shake off the excess, then dredge it though the beer batter and let it drip off the excess for a bit.",
            "Place the fish into the oil and fry for 5 mins, flipping half way through.",
            "Fry in batches so you don't cool the oil down too much or croud the pot/pan."
          ]
        },
        {
          "Section": "For the Slaw",
          "Steps": [
            "Put the cabbage into a big bowl and squish/bruise it a bit.",
            "Add all the other ingredients.",
            "Mix it all together.",
            "Add salt and pepper to taste."
          ]
        },
        {
          "Section": "For the Sauce",
          "Steps": [
            "Add everthing to a bowl and mix."
          ]
        },
        {
          "Section": "Plating",
          "Steps": [
            "Lay down a tortilla then add some slaw.",
            "Add some pickled jalapenos and cilantro",
            "Put on some of the fish.",
            "Slap some sauce on.",
            "Sqeeze some lime juice (very important)"
          ]
        }
      ]
    },
    {
      "Title": "Swedish Meatballs w Mashed Potatos",
      "TotalTime": "45 minutes",
      "ServingSize": "4-5 people",
      "Type": "Chef",
      "Calories": "Who cares",
      "Protein": "Dunno",
      "Carbs": "Enough",
      "Ingredients": {
        "Meatballs": [
          "1 large onion",
          "500g ground pork",
          "500g ground beef",
          "1 large egg",
          "1 tbsp (15g) mustard",
          "0.5 cups (120g) of heavy cream",
          "1 cup (130g) bread crumbs",
          "2 tsp (15g) all spice",
          "2 tsp mixed herbs",
          "salt and pepper"
        ],
        "Mashed Potatoes": [
          "3 lbs Yuklon gold potato (or any yellow fleshed potatos)",
          "0.75 cups (170g) salted butter",
          "0.5 cups (120ml) milk",
          "1 bundle of chives chopped"
        ],
        "Gravy": [
          "400ml beef stock",
          "500ml heavy cream",
          "50g butter",
          "0.33 cup AP flour"
        ],
        "Pickles": [
          "Refer to the pickles recipe"
        ],
        "Lingonberry Jam": [
          "Trust me. Buy 1 jar from ikea, it's way better than cranberry sauce"
        ]
      },
      "Instructions": [
        {
          "Section": "For the BALLS",
          "Steps": [
            "Preheat oven to 400F.",
            "Dice the onion and fry in butter until browned.",
            "In a bowl, add the onion, and the rest of the meat ball ingredients and mix throughly.",
            "Roll the mixture into balls and place them onto oven trays.",
            "(can leave them in the fridge for an hour but I skip it cuz who cares right?)",
            "Toss those bad boys into the oven and bake for 25 mins or until the internal temperature is 145F"
          ]
        },
        {
          "Section": "For the Mashed Potatoes",
          "Steps": [
            "I normally don't peel the potatos cuz the skins give it texture when done right and I'm lazy. If you are not peeling, you need to wash the potatoes",
            "Cut the potatos into big chunks (cooks them faster).",
            "Place potatos into a pot and cover with cold water.",
            "Boil for 20 mins or until they are easily pierced with a fork.",
            "Strain them then mash with a masher, add bunch of salt and pepper to taste (more salt than you think, I promise. Whatever you added, add more)",
            "Add the rest of the potatos ingredients and mix.",
            "Chop the chives and mix it in with the potatos."
          ]
        },
        {
          "Section": "For the Gravy",
          "Steps": [
            "Add all the ingredients to a sauce pot and let it boil and reduce to the thickness of your liking."
          ]
        },
        {
          "Section": "Plating",
          "Steps": [
            "Place some of the BALLS onto the plate.",
            "Put some mashed taters next to it then drizzle gravy onto the balls and taters",
            "Add some pickles on the side and a glob of the lingonberry jam."
          ]
        }
      ]
    },
    {
      "Title": "Miso Salmon w Asian Sides",
      "TotalTime": " 2 hours 15 minutes",
      "ServingSize": "4",
      "Type": "Chef",
      "Calories": "Who cares",
      "Protein": "Dunno",
      "Carbs": "Enough",
      "Ingredients": {
        "Miso Salmon": [
          "4 skin on salmon fillets",
          "4 tbsp miso (try to get white miso)",
          "2 tbsp sake",
          "2 tbsp soy sauce",
          "0.5 tsp sesame oil"
        ],
        "Edamame Salad": [
          "12 oz edamame",
          "1 cup diced cucumbers",
          "1 red bell pepper",
          "2 green onion stalks",
          "0.25 cup chopped cilatro",
          "2 tsp sesame seeds",
          "2 tbsp rice wine vinegar",
          "2 tsp olive oil",
          "1 tsp sesame oil",
          "1 tsp tamari or soy sauce",
          "2 tsp honey",
          "0.5 tsp siracha",
          "0.25 tsp ground ginger"
        ],
        "Spinach Gomaae": [
          "1 bunch (227g) of spinach ",
          "3 tbsp toasted sesame seeds",
          "1 tbsp soy sauce",
          "1 tbsp sugar"
        ],
        "Rice": [
          "3 cups of uncooked rice (start cooking the rice at the begining)."
        ]
      },
      "Instructions": [
        {
          "Section": "For the Salmon",
          "Steps": [
            "In a bowl, add the miso, sake, soy sauce, sesame oil and mix throughly.",
            "Place the fish into the marinade then coat them, then let it rest in the fridge for 1-2 hours.",
            "Bake in the oven at 425F for 20-30 mins or broil for until internal temp is 125F-130F."
          ]
        },
        {
          "Section": "For the Edamame Salad",
          "Steps": [
            "For the edamame, I normally buy the frozen already peeled ones from the store (cook according to the package, I use the microwave)",
            "Dice the cucumber, bell pepper, green onions, and chop the cilantro.",
            "In a jar or bowl, add the rice wine vinegar, olive oil, sesame oil, temari/soy sauce, honey, siracha, ground ginger.",
            "If you added it to a jar, put the lid on and shake it, otherwise, whisk the ingredients in the bowl.",
            "Add the salad inbgredients to a bowl, then drizzle the vinegrette over it.",
            "Sprinkle some sesames seeds on and its done."
          ]
        },
        {
          "Section": "For the Spinach Gomaae",
          "Steps": [
            "Toast the sesame seeds in a pan until it smells good AF.",
            "Once toasted, grind it into kind of a paste in a mortar and pestle.",
            "Add the soy sauce and sugar then mix.",
            "Prepare a bowl with ice water",
            "In a pot, add water and salt to blanch the spinach, bring it to a boil.",
            "Once the water is boiling, blanch the spinach for 45 seconds.",
            "Dunk the spinach into the ice water to cool, then wring it dry.",
            "Chop the spinach into 1 inch sections then mix the sesame paste thing in with it. "
          ]
        },
        {
          "Section": "Plating",
          "Steps": [
            "Put the salmon on the plate.",
            "Put some edamame salad with the vinegrette in a seperate bowl.",
            "Put the spinach gomaae on the plate.",
            "Serve with rice."
          ]
        }
      ]
    }
  ]
}