{
  "recipes": [
    {
      "Title": "Sriracha Peanut Chicken Meal Prep",
      "TotalTime": "30 minutes",
      "ServingSize": "5 servings",
      "Img": "/img/siracha-chicken.jpg",
      "Type": "Shrink",
      "Calories": 584,
      "Protein": "45g",
      "Carbs": "54g",
      "Ingredients": {
        "SAUCE": [
          "¼ cup (60 g) soy sauce",
          "2 tbsp (28 g) peanut butter",
          "1 tbsp (15 g) rice vinegar",
          "2 tbsp (42 g) honey",
          "2 cloves (15 g) minced garlic",
          "1 tbsp (15 g) sriracha",
          "2 tsp (10 g) sesame oil"
        ],
        "CHICKEN": [
          "2 lbs (908 g) boneless skinless chicken thighs",
          "1 tbsp (14 g) mayonnaise",
          "1 tbsp (15 g) sriracha",
          "1 tbsp (15 g) rice vinegar",
          "2 tsp (6 g) onion powder",
          "2 tsp (6 g) garlic powder",
          "1 tsp (6 g) salt"
        ],
        "RICE BOWLS": [
          "3 medium (100 g) carrots",
          "½ lb (227 g) broccoli",
          "1 small (150 g) onion",
          "3 cups (450 g) cooked rice",
          "1 tbsp (15 g) oil",
          "2 (15 g) green onions optional",
          "¼ cup (30 g) crushed peanuts optional"
        ]
      },
      "Instructions": [
        {
          "Section": "For the rice",
          "Steps": [
            "Day-old rice is best for these rice bowl-style recipes as it has had time to dry out a bit. Frozen rice is also a good choice. If you don't want to wait for day-old rice, fresh rice works well too.",
            "Prepare enough rice to yield 3 cups of cooked rice. 1 cup of dry rice will make 2-3 cups of cooked rice depending on the kind of rice you are using."
          ]
        },
        {
          "Section": "For the chicken",
          "Steps": [
            "Preheat your oven to 425°F.",
            "In a bowl, add the mayo, sriracha, rice vinegar, garlic powder, onion powder, and salt. Mix together to combine.",
            "Add the chicken thighs to the bowl and toss to coat. Marinating this for an hour or two can help make the chicken more flavorful, but it's also fine to cook it right away.",
            "Line a sheet pan with foil or parchment and lay the chicken thighs on top with the smooth side facing down. Roast for 10 minutes, then turn the oven to broil and broil for about 5 minutes to brown the chicken. Be careful not to burn the chicken as the broiler is very hot.",
            "Allow the chicken to rest for a couple of minutes, then dice it into bite-sized pieces."
          ]
        },
        {
          "Section": "For the sauce",
          "Steps": [
            "Mix all of the sauce ingredients in a bowl and stir vigorously."
          ]
        },
        {
          "Section": "For the rice bowls",
          "Steps": [
            "Cut your onion into thin slices.",
            "Chop the broccoli into small, bite-sized florets.",
            "Shred the carrots into ribbons using a vegetable peeler.",
            "Chop the green onion tops into thin slices.",
            "In a large skillet over medium-high heat, add the broccoli with about ¼ cup of water. This will help it steam and cook to soften. By the time the water boils off, they will be close to being ready, and you can cook the remaining vegetables.",
            "Make room in the center of the skillet and add 1 tbsp of oil. Dump the onions into the center and cook for about 1-2 minutes so they get some color. Add in the carrots shortly after and cook the vegetables together for another minute or two.",
            "Add your cooked rice to the skillet and pour the sauce over the top of the rice and vegetables. Stir to combine and coat the contents of the pan.",
            "Add in the chicken and mix. Taste test and adjust the seasonings with salt and pepper as needed. If you want more spice, use more sriracha. Any of the flavors can be adjusted to meet your preferences."
          ]
        },
        {
          "Section": "Plating",
          "Steps": [
            "This recipe makes 5 servings. Divide the contents of the skillet evenly into your 5 containers.",
            "Top each dish with green onions and crushed peanuts."
          ]
        }
      ]
    },
    {
      "Title": "Baked Penne",
      "TotalTime": "1 hour 10 minutes",
      "ServingSize": "5 servings",
      "Img": "/img/baked-penne.jpg",
      "Type": "Big",
      "Calories": 1040,
      "Protein": "68g",
      "Carbs": "86g",
      "Ingredients": {
        "Penne Pasta Noodles": [
          "12 oz (340 g) penne pasta noodles uncooked, gluten free if needed"
        ],
        "Ground Beef and Tomato Sauce": [
          "2 lbs (908 g) ground beef 85/15",
          "28 oz (794 g) petite diced tomatoes (3 cans)",
          "28 oz (794 g) crushed tomatoes (1 can)",
          "1 medium (200 g) onion",
          "1 tbsp (15 g) minced garlic",
          "1 tbsp (2 g) dried oregano",
          "1 tbsp (2 g) dried basil",
          "10 oz (283 g) spinach (1 bag)",
          "1 tbsp (15 g) oil",
          "Salt and pepper to taste"
        ],
        "Cheese Topping": [
          "15 oz (425 g) low-fat ricotta cheese",
          "1 cup (112 g) shredded mozzarella cheese",
          "½ cup (50 g) shredded parmesan cheese"
        ]
      },
      "Instructions": [
        {
          "Section": "For the Beef and Tomato Sauce",
          "Steps": [
            "In a large pot over medium-high heat, add the ground beef and brown.",
            "While the beef is cooking, dice the onion and add it to the pot with the beef. Add the minced garlic as well. Season lightly with salt and pepper.",
            "Once the meat has browned, add in the cans of petite diced and crushed tomatoes. Stir in the oregano and basil. Allow the mixture to boil for 10-20 minutes to cook out the tomato flavor.",
            "Chop up the spinach and add it to the pot. Stir to incorporate and wilt the leaves."
          ]
        },
        {
          "Section": "For the Casserole",
          "Steps": [
            "Preheat your oven to 400°F.",
            "While the beef and sauce are cooking, bring a large pot of water to a boil and cook the noodles according to the packaging. Drain the water.",
            "Once the noodles and sauce have finished cooking, combine the two together and season with salt and pepper to taste.",
            "In a large casserole or baking dish, add about half of the noodle mixture in a single layer. Spread out the ricotta cheese over the top of this layer and pour the remaining noodle mixture over the top.",
            "Top the entire dish with the parmesan and mozzarella cheese.",
            "Place the dish on a sheet pan to protect from any leakage and place it into the oven. Bake for 30 minutes. Watch it closely as you don't want to burn the cheese. If it gets too brown you can cover it with a piece of aluminum foil.",
            "Allow the casserole to rest and cool before cutting into it."
          ]
        },
        {
          "Section": "Plating",
          "Steps": [
            "This recipe makes 5 servings. Divide the tray into 5 equal-sized pieces and add to each of your dishes. They will last in the fridge for 5 days."
          ]
        }
      ]
    }
    
  ]
}
